using static Shares;


// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.

// int number = Input("Введите число:");
// Decrease(number);



// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

// int begin = Input("Введите начальную точку промежутка:");
// int end = Input("Введите конечную точку промежутка:");
// Console.WriteLine(Summ(begin, end));



// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.

// int m = Input("Введите первое число:");
// int n = Input("Введите второе число:");
// int result = Acker(m, n);
// Console.WriteLine(result);